app/controllers/blogs_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at desc
---
    def index
		@posts= Post.all.order("created_at desc")

INSERT INTO "posts" ("title", "content", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "sub_title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
	def create
		@post=current_user.posts.build(post_params)
		if @post.save

UPDATE "posts" SET "number_of_views" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["number_of_views", 1], ["updated_at", "2016-03-10 10:25:19.841532"], ["id", 2]]
SELECT  "posts".* FROM "posts" LIMIT 10
---
	def show
		@post.number_of_views= @post.number_of_views + 1
		@post.save
		@posts=Post.all.limit(10)